{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.4", "config": [{"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 64, 64, 3], "kernel_size": [3, 3], "data_format": "channels_last", "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "filters": 32, "use_bias": true, "padding": "valid", "dtype": "float32", "kernel_regularizer": null, "activation": "relu", "dilation_rate": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "strides": [1, 1]}}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "data_format": "channels_last", "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "filters": 32, "use_bias": true, "padding": "valid", "kernel_regularizer": null, "activation": "relu", "dilation_rate": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "strides": [1, 1]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 128, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "activation": "softmax"}}]}